:PROPERTIES:
:ID:       97180e72-7898-4c2b-a99b-a1fb6f8c7790
:END:
#+title: Joins in MySQL
#+author: pspiagicw
#+date:<2021-09-27 Mon>
#+property: header-args:sql :dhhost 127.0.0.1 :engine mysql :dbpassword shrgooglegithub :database practical :resutls output
** Sum
   Sums the values in the collection.
   Denoted by $\textsl{G}_{sum}$.
   Here: $\textsl{G}_{sum(salary)} ( Programmers )$
   #+begin_src sql
select sum(salary) from programmers;
   #+end_src

   #+RESULTS:
   | sum(salary) |
   |-------------|
   |       10645 |

** Avg
   Computes the avg of values in the collection
   Denoted by $\textsl{G}_{avg}$
   Here: $\textsl{G}_{avg(salary)} ( Programmers )$
   #+begin_src sql
select avg(salary) from programmers;
   #+end_src

   #+RESULTS:
   | avg(salary) |
   |-------------|
   |   5322.5000 |

** Count
   Counts number of elements in the collection
   Denoted by $\textsl{G}_{count}$
   Here: $\textsl{G}_{count{salary)} (Programmers)$
   #+begin_src sql
select count(salary) from programmers;
   #+end_src

   #+RESULTS:
   | count(salary) |
   |---------------|
   |             2 |

** Min
   Returns minimum value in the collection
   Denoted by $\textsl{G}_{min}$
   Here: $\textsl{G}_{min(salary)} (Programmers)$
   #+begin_src sql
select min(salary) from programmers;
   #+end_src

   #+RESULTS:
   | min(salary) |
   |-------------|
   |         145 |

** Max
   Returns the maximum value in the collection.
   Denoted by $\textsl{G}_{max}$
   Here: $\textsl{G}_{max(salary)} ( Programmers)$
   #+begin_src sql
select max(salary) from programmers;
   #+end_src

   #+RESULTS:
   | max(salary) |
   |-------------|
   |       10500 |

